---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.SplineFailures
source: html/e88537cf-2462-ba91-30de-b02885663425.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SplineFailures

Failures about Spline.

## Syntax (C#)
```csharp
public static class SplineFailures
```